export default [
    {
        id: 1,
        question: "من هي أم رسول الله صلى الله عليه وسلم؟",
        options : [
            "أمين",
            "حواء",
            "سمية رع",
        ]
    },
    {
        id : 2,
        question: "من هو والد رسول الله صلى الله عليه وسلم؟",
        options: [
            "حمزة رع",
            "عبدالله",
            "أبو طالب",
        ]
    },

     {   id: 3,
        question :' ما الترتيب الصحيح لاسم رسول الله صلى الله عليه وسلم؟',
        options: [
            'محمد بن هاشم بن عبد الله بن عبد المناف بن قيسي بن كلاب',
            'محمد بن عبد الله بن عبد المطلب بن هاشم بن عبد المناف بن قصي بن كلاب ﷺ',
            "محمد بن عبد المطلب بن هاشم بن كلاب بن قصي بن عبد المناف",
        ]
    },
    {
          id: 4,
        question :" ما اسم قبيلة رسول الله صلى الله عليه وسلم ؟",
        options : [
            " بنو ندرى ",
            "بني زهرة",
            "قريش",
        ]
    },
    {
        id: 5,
        question : "من هو أول رئيس تنفيذي لكابا من قريش؟",
        options: [
            "هاشم",
            "قُصي",
            "أبو لهب",
        ]
    },
    {
        id:6,
        question :' ما اسم عائلة رسول الله ﷺ؟',
         options : [
       ' كنانة',
        "قريشي",
        "الهاشمية",
    ]
},
{
    id: 7,
    question : "إن جد رسول الله صلى الله عليه وسلم  بذبح أحد أبنائه إذا أعطاه الله 10 أبناء فمن هو الابن الذي يذبح؟",
    options : [
        "حمزة رع",
        "عبدالله",
        "أبو طالب",
    ]
},
{
    id: 8,
    question: "رسول الله صلى الله عليه وسلم يُدعى إبينو الذبيحينين من همالذبيحين؟",
    options: [
        'عبدالله وإبراهيم ع',
        "عبدالله وإسماعيل ع",
        'موسى ع وإبراهيم ع',
    ]
},
{
    id: 9,
    question: "ما هي فديه التي تمت الذبيحين؟",
    options: [
        "خروف واحد و50 عنزة",
        "خروفان و40 عنزة",
        "خروف و100 جمل",
    ]
},
{
id: 10,
question: 'من أعان أم رسول الله على ولادة الرسول صلى الله عليه وسلم؟',
options: [
    "نسيبة",
    "شفاء بنت عمرو",
    "زينب بنت جحش",
]
},
{
id: 11,
question:' متى توفي والد رسول الله صلى الله عليه وسلم؟',
options: [
    "في سن الثانية",
    "في سن الـ12",
    'قبل الولادة',
]
},
{
id: 12,
question: "هل كانت مربية الرسول صلى الله عليه وسلم؟",
options: [
    "أومو أيمن بركات الحبشية",
    "سمية رع",
    "زينب",
]
},
{
id: 13,
question: "حسب ثقافة العرب يؤخذ الأطفال ويعطى لنساء الريف ليقيمن ويرضعن، فمن الذي أخذ رسول الله صلى الله عليه وسلم وأرضعه؟",
options : [
    "حليمة",
    "السويبع",
    "رقية",
]
},
{
id: 14,
question: 'كم مكث رسول الله صلى الله عليه وسلم في الريف؟',
options: [
    ' سنتان',
    "4 سنوات",
    '10 سنوات',
]
},{
    id:15,

        question: "يوم ولدت الرسول صلى الله عليه وسلم؟",
        options: [
            "ربيع أول 9 سنة الفيل",
            "9 شعبان سنة الفيل",
            "رمدان 15",
        ]
    },
    {
        id: 16,
        question: "ماذا يحدث خلال فترة تواجد الرسول صلى الله عليه وسلم في الريف مما يخيف أهل الريف من إعادته إلى والديه الحقيقيين؟",
        options : [
            "وباء",
            'جفاف',
            "جراحة قلبه",
        ]
    },
    {
        id: 17,
        question : "في أي عمر توفيت والدة رسول الله ﷺ؟",
        options : [
            "في سن التاسعة",
            "في سن الثالثة",
            "في سن السادسة",
        ]
    },
    {
        id: 18,
        question : 'ما اسم المكان الذي توفيت فيه والدة رسول الله صلى الله عليه وسلم ودفنت؟',
        options : [
            "بيكي",
            "أبووا",
            "نعمريب",
        ]
    },
    {
        id: 19,
        question : "بعد وفاة جد رسول الله وهو في الثامنة من عمره من تولى رعاية الرسول صلى الله عليه وسلم؟",
        options: [
            "أبوطالب",
            "حمزة رع",
            "حليمة",
        ]
    },
    {
        id:20,
    
    question: "من هو الرجل الذي حاول خراب الكعبة فخرج ومعه 60 ألف جندي وفيل؟",
    options : [
        "جبريسيلاس",
        "أبرهة",
        "أكرا",
    ]
} ,
{
    id: 21,
    question: "كان رسول الله ﷺ يعمل عند خديجة تاجرًا وكان عبدًا لها يسافر معه ويخبرها بالعجائب التي رآها؟",
    options : [
    "أبو سلمة",
    "ميسيرا",
    "بلال رع",
    ]
   },
   {
    id: 22,
    question : "أخبر راهب جماعة من التجار من قريش حيث كان رسول الله صلى الله عليه وسلم أنه سيكون نبيا، ما اسمه؟",
    options : [
    "البحيرة",
    "خالد",
    "أبو طالب"
    ]
   },
   {
    id: 23,
    question: "ما الدليل الذي قدمه لهم على إثبات كلامه وأنه مذكور في كتابهم؟",
    options : [
    "أن له في ظهره ختما وهو علامة النبوة",
 'يسجد له كل النبات والحجر إذا قدم»',
 'الجميع',


]
},
{
    id: 24,
    question : "عندما كان رسول الله صلى الله عليه وسلم في العشرين من عمره، حدثت حرب بين قريش وكنانة مع قيس إيلان، ما اسم الحرب؟",
    options : [
    "أحد",
    "حرب الفجار",
    "الأحزاب",
    ]
    },
   
    {
    id: 25,
    question: 'كم عدد أولاد رسول الله صلى الله عليه وسلم من خديجة؟',
    options: [
    "4 أبناء وبنتين",
    "4 بنات وولدين",
    "إبراهيم فقط",
    ]
    },

]
export const answers = [0, 1, 1, 2, 1,2,1,1,2,1,2,0,0,1,0,2,2,1,0,1,1,0,2,1,1];